fixtures/subscriptions/subscriptions.json

{
  "object": "list",
  "url": "/v1/customers/cus_123456789/subscriptions",
  "count": 1,
  "data": [
    {
      "id": "sub_123456789",
      "plan": {
        "interval": "month",
        "name": "New plan name123",
        "created": 1386247539,
        "amount": 2000,
        "currency": "usd",
        "id": "plan",
        "object": "plan",
        "livemode": false,
        "interval_count": 1,
        "trial_period_days": null,
        "metadata": {
        },
        "statement_description": null
      },
      "object": "subscription",
      "start": 1395173457,
      "status": "active",
      "customer": "cus_123456789",
      "cancel_at_period_end": false,
      "current_period_start": 1395173457,
      "current_period_end": 1397851857,
      "ended_at": null,
      "trial_start": null,
      "trial_end": null,
      "canceled_at": null,
      "quantity": 1,
      "application_fee_percent": null,
      "discount": null
    }
  ]
}
